Autodesk.Revit.DB.OverridePermissions
Types of overrides that can be applied to a category.
Since:
2014

Autodesk.Revit.DB.OverridePermissions.Surfaces
Surface transparency

Autodesk.Revit.DB.OverridePermissions.ProjectionFills
Projection fills

Autodesk.Revit.DB.OverridePermissions.ProjectionLines
Projection lines

Autodesk.Revit.DB.OverridePermissions.CutFills
Cut fills

Autodesk.Revit.DB.OverridePermissions.CutLines
Cut lines

Autodesk.Revit.DB.OverridePermissions.Halftone
Halftone

Autodesk.Revit.DB.OverridePermissions.ViewDetailLevel
View detail level